export const MSC_REQS = {
  1: {
    category: "MSC",
    type: "each",
    items: [
      { label: "대학수학(1)", ids: ["012201"] },
      { label: "대학수학(2)", ids: ["012202"] },
      { label: "응용수학(1)", ids: ["012203"] },
      { label: "응용수학(2)", ids: ["012204"] },
      { label: "선형대수학", ids: ["012205"] },
      {
        label: "대학물리(1)+대학물리실험(1)",
        ids: ["012101", "012103"],
        allRequired: true,
      },
      {
        label: "대학물리(2)+대학물리실험(2)",
        ids: ["012104", "012106"],
        allRequired: true,
      },
      {
        label: "대학화학(1)+대학화학실험(1)",
        ids: ["012107", "012109"],
        allRequired: true,
      },
      {
        label: "대학화학(2)+대학화학실험(2)",
        ids: ["012110", "012113"],
        allRequired: true,
      },
    ],
  },

  2: {
    type: "mscCombined",
    category: "MSC",
    sections: [
      {
        label: "수학 & 과학",
        required: 17,
        courses: {
          // 수학분야
          "012201": 3, // 대학수학(1)
          "012202": 3, // 대학수학(2)
          "012203": 3, // 응용수학(1)
          "012204": 3, // 응용수학(2)
          "012205": 3, // 선형대수학
          "012206": 3, // 이산수학
          "012207": 3, // 통계학
          "012208": 3, // 컴퓨터응용통계
          "012210": 3, // 확률및통계
          "012211": 3, // 편미분방정식
          "012301": 3, // 공학컴퓨터입문및실습
          "012313": 3, // MATLAB프로그래밍및실습
          "012303": 3, // 공학CAD및GRAPHICS
          "012308": 3, // 수치해석
          // 과학분야
          "012101": 3, // 대학물리(1)
          "012103": 1, // 대학물리실험(1)
          "012104": 3, // 대학물리(2)
          "012106": 1, // 대학물리실험(2)
          "012107": 3, // 대학화학(1)
          "012109": 1, // 대학화학실험(1)
          "012110": 3, // 대학화학(2)
          "012113": 1, // 대학화학실험(2)
          "012122": 3, // 대학생물(1)
          "012123": 1, // 대학생물실험(1)
          "012124": 3, // 대학생물(2)
          "012125": 1, // 대학생물실험(2)
          "012114": 3, // 현대물리
          "012126": 3, // 생물학(1)
          "012127": 3, // 생물학(2)
          "012118": 3, // 물리화학
          "012119": 3, // 유기화학
          "012120": 3, // 광학
        },
      },
    ],
    eachItems: [
      { label: "C-프로그래밍", ids: ["101810"] },
      { label: "객체지향프로그래밍", ids: ["012305"] },
    ],
  },
};
